&Перед("ОтправитьОтчетыПолучателю")
Процедура _ОтправитьОтчетыПолучателю(Вложения, ПараметрыДоставки, СтрокаПолучатель)

	Возврат;
	
	Если ПараметрыДоставки.ПисьмоВФорматеHTML И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыДоставки, "ПараметрыПисьма"), "ТипТекста") = "HTML"
		И СтрЧислоВхождений(ПараметрыДоставки.ШаблонТекста, "[ТелоОтчета]") Тогда

		Текст = Новый Массив;

		Для Каждого Вложение Из Вложения Цикл

			Если Вложение.Настройки.Формат = Перечисления.ФорматыСохраненияОтчетов.HTML Или Вложение.Настройки.Формат
				= Перечисления.ФорматыСохраненияОтчетов.HTML4 Тогда

				Чтение = Новый ЧтениеТекста(Вложение.Значение);
				Текст.Добавить(СтрЗаменить(Чтение.Прочитать(), Символы.ПС, "<br>"));
				Чтение.Закрыть();

			КонецЕсли;

		КонецЦикла;

		ПараметрыДоставки.ШаблонТекста = СтрЗаменить(ПараметрыДоставки.ШаблонТекста, "[ТелоОтчета]", СтрСоединить(
			Текст, "<br>"));

	КонецЕсли;

КонецПроцедуры